public/documents/1607505608_bar

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2020/XMLSchema" xmlns:xsi="http://www.w3.org/2020/XMLSchema-instance">
   <SOAP-ENV:Header>
      <m:MessageHeader xmlns:m="http://www.ebxml.org/namespaces/messageHeader">
         <m:From>
            <m:PartyId type="urn:x12.org:IO5:01">99999</m:PartyId>
         </m:From>
         <m:To>
            <m:PartyId type="urn:x12.org:IO5:01">123123</m:PartyId>
         </m:To>
         <m:CPAId>M6QK</m:CPAId>
         <m:ConversationId>abc123</m:ConversationId>
         <m:Service m:type="OTA">Air Shopping Service</m:Service>
         <m:Action>BargainFinderMaxRQ</m:Action>
         <m:MessageData>
            <m:MessageId>mid:20001209-133003-2333@clientofsabre.com</m:MessageId>
            <m:Timestamp>2020-02-15T11:15:12Z</m:Timestamp>
            <m:TimeToLive>2020-02-15T11:15:12Z</m:TimeToLive>
         </m:MessageData>
         <m:DuplicateElimination />
         <m:Description>Bargain Finder Max Service</m:Description>
      </m:MessageHeader>
      <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext">
         <wsse:BinarySecurityToken valueType="String" EncodingType="wsse:Base64Binary">Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESD!ICESMSLB\/RES.LB!-2825383726363234933!147747!0</wsse:BinarySecurityToken>
      </wsse:Security>
   </SOAP-ENV:Header>
   <SOAP-ENV:Body>
      <OTA_AirLowFareSearchRQ xmlns="http://www.opentravel.org/OTA/2003/05" xmlns:xs="http://www.w3.org/2020/XMLSchema" Target="Production" Version="6.1.0" ResponseType="OTA" ResponseVersion="6.1.0">
         <POS>
            <Source PseudoCityCode="M6QK">
               <RequestorID ID="1" Type="1">
                  <CompanyName Code="TN" />
               </RequestorID>
            </Source>
         </POS>
         <OriginDestinationInformation RPH="1">
            <DepartureDateTime>2021-03-31T00:00:00</DepartureDateTime>
            <OriginLocation LocationCode="KTM" />
            <DestinationLocation LocationCode="AUH" />
            <TPA_Extensions>
               <SegmentType Code="O" />
            </TPA_Extensions>
         </OriginDestinationInformation>
         <TravelPreferences ValidInterlineTicket="true">
            <TPA_Extensions>
               <TripType Value="OneWay" />
               <LongConnectTime Min="780" Max="1200" Enable="true" />
               <ExcludeCallDirectCarriers Enabled="true" />
            </TPA_Extensions>
            <Baggage RequestType="A" Description="true" FreePieceRequired="true" />
         </TravelPreferences>
         <TravelerInfoSummary>
            <SeatsRequested>1</SeatsRequested>
            <AirTravelerAvail>
               <PassengerTypeQuantity Code="ADT" Quantity="1" />
            </AirTravelerAvail>
         </TravelerInfoSummary>
         <TPA_Extensions>
            <IntelliSellTransaction>
               <RequestType Name="50ITINS" />
            </IntelliSellTransaction>
         </TPA_Extensions>
      </OTA_AirLowFareSearchRQ>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
